#!/usr/bin/lessons
# -*- coding: utf-8 -*-
# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

#a=["яблоко", "банан", "киви", "арбуз"]
a=["bb", "b"]
c=a.format({:>})
print (c)